#+title: universal database access with org babel and lsp-mode

This has some tricky pieces, let me just paste in what I did so far that also has some other pages mixed in that need separated:

** does it work in source blocks
#+begin_src sql :engine postgresql :dbconnection db1-prod
  select * from public.auth_fact limit 1;
#+end_src

#+RESULTS:
|---|

** apparently you should be able to use a header arg called dbconnection but I don't see it working
https://lists.gnu.org/archive/html/emacs-orgmode/2019-03/msg00277.html

#+begin_src sql :engine postgresql :dbconnection db1-prod
  select * from public.auth_fact limit 1;
#+end_src

#+RESULTS:
|---|

  #+begin_src sql :engine postgresql :dbconnection mydb
    select foo, bar, baz from mytable
  #+end_src

  #+RESULTS:
  |---|

